for x in range (1, 15, 3): # для х в дівпазоні (від 1, до 15, з кроком 3)
    print("x = " + str(x)) # виводити х
    if x == 10: # якщо х зрівняється з 10:
        break # зупинити цикл
print("-------------------------------------")

h="allah akbar"
for m in h: # для m (символ) в h (строка), де h це строка "аллах акбар"
    print(m, end = " ") # виводити m з кінцем строки "пробіл"
    if m == "k": # якщо m зрівняється з "k":
        print("\n!!!letter K detected!!!", end = "\n") # вивести на екран повідомлення "знайдено букву К!"
        continue # продовжити цикл

print("\n-------------------------------------")

for n in "oleg taktarov": # для n (символ) в "строці":
    if n == "w": # якщо n зрівняється з "w":
        break # зупинити цикл
    else: # в іншому випадку:
        print("there is no w", end = "\n") # виводити повідомлення, що букви не знайдено з переходом на нову строку при перевірці кожного символа


print("-------------------------------------")
x = 0
while True: # пока ТРУ:
    print(x) # виводить х
    x = x + 2 # х + 2
    if x == 12: # якшо х зрівняється з 12:
        break # зупинити цикл
print("-------------------------------------")
y = 0
while y < 15: # поки у меньше 15:
    print(y) # виводити у
    y = y + 3 # у + 3


