p = list(range(0, 27)) # створив массив "р" з діапазоном від 0 до 27

for x in range(min(p), max(p), 4): # цикл з діапазоном від мінімального числа в масиві "р" до максимального числа в масиві "р" з кроком 4
    if (x <= 10):
        print(x, 'child') # якщо в циклі опрацьовується число меньше 10 - видасться на екран, шо це дитина
    elif (x > 10 and x<= 20):
        print(x, 'teenager') # якщо в циклі опрацьовується число більше 10 і меньше-дорівнює 20 - видасться на екран, шо це тінейджер
    else:
        print(x, 'old') # якщо в циклі опрацьовуються інші числа - видасться на екран, шо це старець


c = ['audi', 'mitsubishi', 'porshe', 'bmw', 'ferrari', 'mazda', 'honda', 'vw', 'skoda', 'chevrolet', 'citroen', 'ford', 'suzuki', 'dodge']
euro = ['audi', 'porshe', 'bmw', 'ferrari', 'vw', 'skoda', 'citroen']
asian = ['mitsubishi', 'mazda', 'honda', 'suzuki'] # три масиви, де "с" - всі машини, "євро" - європейські машини, "асіан" - машини з Азії

for x in c: # цикл де йде опрацювання елементів масиву "с"
    c.sort() # відсортував весь цикл в алфавітному порядку
    x = x.title() # всі елементи зробив із заглавними літерами
    for i in x: # цикл де йде опрацювання "і" (букв) в елементах масиву "х" (слова) [це для елементів з літерою w, таких як BMW та VW]
        if (i == 'w'): # якщо "і"зрівняєтсья з буквою "w"
            x = x.upper() # зробити "х" із великими буквами
    if x in euro:
        print(x, ' is euro car') # якщо елементи "х" є і в масиві "євро", то вивести на екран, що це європейська машина
    elif x in asian:
        print(x, ' is asian car') # якщо елементи "х" є і в масиві "асіан", то вивести на екран, що це азіатська машина
    else:
        print(x, ' is american car') # якщо елементи "х" не попали у вище перечислені масиви, то вивести на екран, що це американська машина
